>>> from bible import *
>>> tri(62)
1953
>>> tri(53)
1431
>>> Fibonacci(53)
53316291173
>>> 7**4
2401
>>> base(7,2701)
[1, 0, 6, 0, 6]
>>> base(7,1189)
[3, 3, 1, 6]
>>> base(7, 797)
[2, 2, 1, 6]
>>> base(7, 595)
[1, 5, 1, 0]
>>> 
>>> 
>>> 
>>> 
>>> tell('מָשִׁיחַ')
 מָ שִׁ  י  חַ
13+21+10+8=52
>>> tell('יהושוע',osum,ssum)
י  ה ו  ש  ו ע
10+5+6+ 21+6+16= 64
10+5+6+300+6+70=397
>>> tell('ישוע',osum,ssum)
י   ש  ו ע
10+ 21+6+16= 53
10+300+6+70=386
>>> tell('יְהוֹשֻׁעַ')
 יְ ה וֹ שֻׁ   עַ
10+5+6+21+16=58
>>> tell('ישוע')
י  ש  ו ע
10+21+6+16=53
>>> tell('יֵשׁוּעַ',lsum,osum,ssum)
 יֵ  שׁ  וּ  עַ
1 + 1 +1+1 = 4
10+ 21+6+16= 53
10+300+6+70=386
>>> 
