>>> from bible import *
>>> Malachi[4:2].tell(lsum,osum,ssum)
But unto you  that fear  my name shall the Sun of righteousness arise with healing in his wings; and  ye shall go forth, and grow  up  as calves of the stall.   =
 3   4    3    4    4    2   4     5    3   3  2        13        5    4      7    2   3    5     3   2    5   2    5     3   4    2   2    6    2   3    5     120
 43  70   61   49   30   38  33    52   33  54 21      179        52   60     56   23  36   72    19  30   52  22   67    19  63   37  20   62   21  33   64    1471
502 610  1060 409  102  740  96   169  213 450 66      1034      205  717    110   59 117  666    55 705  169  67  364    55 657  370 101  539   66 213  361   11047
>>> tell('וְזָרְחָה לָכֶם יִרְאֵי שְׁמִי, שֶׁמֶשׁ צְדָקָה, וּמַרְפֵּא, בִּכְנָפֶיהָ; וִיצָאתֶם וּפִשְׁתֶּם, כְּעֶגְלֵי מַרְבֵּק.',lsum,osum,ssum)
וְזָרְחָה לָכֶם יִרְאֵי שְׁמִי, שֶׁמֶשׁ צְדָקָה, וּמַרְפֵּא, בִּכְנָפֶיהָ; וִיצָאתֶם וּפִשְׁתֶּם, כְּעֶגְלֵי מַרְבֵּק.  =
  5    3   4    3    3    4     5       6      6      5      5     4    53
  46   36  41   44   55   46    57      59     70     79     52    54  639
 226   90 221  350  640  199   327     167    547    826    133   342  4068
>>> tell('שֶׁמֶשׁ צְדָקָה',lsum,osum,ssum)
שֶׁמֶשׁ צְדָקָה  =
 3   4    7
 55  46  101
640 199  839
>>> tell('heaven',osum,ssum)
h e a  v  e n   =
8 5 1  22 5 14  55
8 5 1 400 5 50 469
>>> 
>>> tell('שְׁלֹמֹה',osum,ssum)
 שְׁ   לֹ  מֹ ה  =
 21 12 13 5  51
300 30 40 5 375
>>> 
>>> tell('sun of righteousness',lsum,osum,ssum)
sun of righteousness  =
 3  2        13       18
 54 21      179      254
450 66      1034     1550
>>> tell('light',osum,ssum)
l  i g h  t   =
12 9 7 8  20  56
30 9 7 8 200 254
>>> tell('וַיֹּאמֶר אֱלֹהִים, יְהִי אוֹר; וַיְהִי אוֹר.',lsum,osum,ssum)
וַיֹּאמֶר אֱלֹהִים, יְהִי אוֹר; וַיְהִי-אוֹר.  =
  5     5     3   3       7      23
  50    41    25  27      58    201
 257    86    25 207     238    813
