בְּרֵאשִׁיתבָּרָאאֱלֹהִיםאֵתהַשָּׁמַיִםוְאֵתהָאָרֶץוְהָאָרֶץהָיְתָהתֹהוּוָבֹהוּוְחֹשֶׁךְעַל
פְּנֵיתְהוֹםוְרוּחַאֱלֹהִיםמְרַחֶפֶתעַלפְּנֵיהַמָּיִםוַיֹּאמֶראֱלֹהִיםיְהִיאוֹרוַיְהִי
אוֹרוַיַּרְאאֱלֹהִיםאֶתהָאוֹרכִּיטוֹבוַיַּבְדֵּלאֱלֹהִיםבֵּיןהָאוֹרוּבֵיןהַחֹשֶׁךְוַיִּ
קְרָאאֱלֹהִיםלָאוֹריוֹםוְלַחֹשֶׁךְקָרָאלָיְלָהוַיְהִיעֶרֶבוַיְהִיבֹקֶריוֹםאֶחָדוַיֹּא
מֶראֱלֹהִיםיְהִירָקִיעַבְּתוֹךְהַמָּיִםוִיהִימַבְדִּילבֵּיןמַיִםלָמָיִםוַיַּעַשׂאֱלֹהִים
אֶתהָרָקִיעַוַיַּבְדֵּלבֵּיןהַמַּיִםאֲשֶׁרמִתַּחַתלָרָקִיעַוּבֵיןהַמַּיִםאֲשֶׁרמֵעַללָרָקִיעַ
וַיְהִיכֵןוַיִּקְרָאאֱלֹהִיםלָרָקִיעַשָׁמָיִםוַיְהִיעֶרֶבוַיְהִיבֹקֶריוֹםשֵׁנִיוַיֹּאמֶר
אֱלֹהִיםיִקָּווּהַמַּיִםמִתַּחַתהַשָּׁמַיִםאֶלמָקוֹםאֶחָדוְתֵרָאֶההַיַּבָּשָׁהוַיְהִיכֵןוַיִּקְ
רָאאֱלֹהִיםלַיַּבָּשָׁהאֶרֶץוּלְמִקְוֵההַמַּיִםקָרָאיַמִּיםוַיַּרְאאֱלֹהִיםכִּיטוֹבוַיֹּאמֶ
ראֱלֹהִיםתַּדְשֵׁאהָאָרֶץדֶּשֶׁאעֵשֶׂבמַזְרִיעַזֶרַעעֵץפְּרִיעֹשֶׂהפְּרִילְמִינוֹאֲשֶׁרזַרְע
וֹבוֹעַלהָאָרֶץוַיְהִיכֵןוַתּוֹצֵאהָאָרֶץדֶּשֶׁאעֵשֶׂבמַזְרִיעַזֶרַעלְמִינֵהוּוְעֵץעֹשֶׂה
פְּרִיאֲשֶׁרזַרְעוֹבוֹלְמִינֵהוּוַיַּרְאאֱלֹהִיםכִּיטוֹבוַיְהִיעֶרֶבוַיְהִיבֹקֶריוֹםשְׁ
לִישִׁיוַיֹּאמֶראֱלֹהִיםיְהִימְאֹרֹתבִּרְקִיעַהַשָּׁמַיִםלְהַבְדִּילבֵּיןהַיּוֹםוּבֵיןהַלָּ
יְלָהוְהָיוּלְאֹתֹתוּלְמוֹעֲדִיםוּלְיָמִיםוְשָׁנִיםטווְהָיוּלִמְאוֹרֹתבִּרְקִיעַהַשָּׁמַ
יִםלְהָאִירעַלהָאָרֶץוַיְהִיכֵןטזוַיַּעַשׂאֱלֹהִיםאֶתשְׁנֵיהַמְּאֹרֹתהַגְּדֹלִיםאֶתהַמָּ
אוֹרהַגָּדֹללְמֶמְשֶׁלֶתהַיּוֹםוְאֶתהַמָּאוֹרהַקָּטֹןלְמֶמְשֶׁלֶתהַלַּיְלָהוְאֵתהַכּוֹכָבִים
וַיִּתֵּןאֹתָםאֱלֹהִיםבִּרְקִיעַהַשָּׁמָיִםלְהָאִירעַלהָאָרֶץוְלִמְשֹׁלבַּיּוֹםוּבַלַּיְלָהוּלְ
הַבְדִּילבֵּיןהָאוֹרוּבֵיןהַחֹשֶׁךְוַיַּרְאאֱלֹהִיםכִּיטוֹבוַיְהִיעֶרֶבוַיְהִיבֹקֶריוֹ
םרְבִיעִיוַיֹּאמֶראֱלֹהִיםיִשְׁרְצוּהַמַּיִםשֶׁרֶץנֶפֶשׁחַיָּהוְעוֹףיְעוֹפֵףעַלהָאָרֶץעַ
לפְּנֵירְקִיעַהַשָּׁמָיִםוַיִּבְרָאאֱלֹהִיםאֶתהַתַּנִּינִםהַגְּדֹלִיםוְאֵתכָּלנֶפֶשׁהַחַיָּההָ
רֹמֶשֶׂתאֲשֶׁרשָׁרְצוּהַמַּיִםלְמִינֵהֶםוְאֵתכָּלעוֹףכָּנָףלְמִינֵהוּוַיַּרְאאֱלֹהִיםכִּיט
וֹבוַיְבָרֶךְאֹתָםאֱלֹהִיםלֵאמֹרפְּרוּוּרְבוּוּמִלְאוּאֶתהַמַּיִםבַּיַּמִּיםוְהָעוֹףיִרֶב
בָּאָרֶץוַיְהִיעֶרֶבוַיְהִיבֹקֶריוֹםחֲמִישִׁיוַיֹּאמֶראֱלֹהִיםתּוֹצֵאהָאָרֶץנֶפֶשׁחַיָּה
לְמִינָהּבְּהֵמָהוָרֶמֶשׂוְחַיְתוֹאֶרֶץלְמִינָהּוַיְהִיכֵןוַיַּעַשׂאֱלֹהִיםאֶתחַיַּתהָאָרֶץ
לְמִינָהּוְאֶתהַבְּהֵמָהלְמִינָהּוְאֵתכָּלרֶמֶשׂהָאֲדָמָהלְמִינֵהוּוַיַּרְאאֱלֹהִיםכִּיטוֹ
בוַיֹּאמֶראֱלֹהִיםנַעֲשֶׂהאָדָםבְּצַלְמֵנוּכִּדְמוּתֵנוּוְיִרְדּוּבִדְגַתהַיָּםוּבְעוֹףהַשָּׁ
מַיִםוּבַבְּהֵמָהוּבְכָלהָאָרֶץוּבְכָלהָרֶמֶשׂהָרֹמֵשׂעַלהָאָרֶץוַיִּבְרָאאֱלֹהִיםאֶתהָאָדָ
םבְּצַלְמוֹבְּצֶלֶםאֱלֹהִיםבָּרָאאֹתוֹזָכָרוּנְקֵבָהבָּרָאאֹתָםוַיְבָרֶךְאֹתָםאֱלֹהִיםוַיֹּ
אמֶרלָהֶםאֱלֹהִיםפְּרוּוּרְבוּוּמִלְאוּאֶתהָאָרֶץוְכִבְשֻׁהָוּרְדוּבִּדְגַתהַיָּםוּבְעוֹף
הַשָּׁמַיִםוּבְכָלחַיָּההָרֹמֶשֶׂתעַלהָאָרֶץוַיֹּאמֶראֱלֹהִיםהִנֵּהנָתַתִּילָכֶםאֶתכָּלעֵשֶׂב
זֹרֵעַזֶרַעאֲשֶׁרעַלפְּנֵיכָלהָאָרֶץוְאֶתכָּלהָעֵץאֲשֶׁרבּוֹפְרִיעֵץזֹרֵעַזָרַעלָכֶםיִהְיֶ
הלְאָכְלָהלוּלְכָלחַיַּתהָאָרֶץוּלְכָלעוֹףהַשָּׁמַיִםוּלְכֹלרוֹמֵשׂעַלהָאָרֶץאֲשֶׁרבּוֹנֶ
פֶשׁחַיָּהאֶתכָּליֶרֶקעֵשֶׂבלְאָכְלָהוַיְהִיכֵןלאוַיַּרְאאֱלֹהִיםאֶתכָּלאֲשֶׁרעָשָׂהוְהִנֵּ
הטוֹבמְאֹדוַיְהִיעֶרֶבוַיְהִיבֹקֶריוֹםהַשִּׁשִּׁי

# >>> 22**3
# 10648
# >>> 33*50+28
# 1678
# >>> 1189*1189*2
# 2827442
# >>> import math
# >>> math.sqrt(2827442)
# 1681.49992566161
# >>> 1682*1681
# 2827442
# >>> 
# >>> 
