βίβλος γενέσεως ἰησοῦ χριστοῦ υἱοῦ δαβὶδ υἱοῦ ἀβραάμ
ἀβραὰμ ἐγέννησεν τὸν ἰσαάκ ἰσαὰκ δὲ ἐγέννησεν τὸν ἰακώβ ἰακὼβ δὲ ἐγέννησεν τὸν ἰούδαν καὶ τοὺς ἀδελφοὺς αὐτοῦ
ἰούδας δὲ ἐγέννησεν τὸν φαρὲς καὶ τὸν ζαρὰ ἐκ τῆς θάμαρ φαρὲς δὲ ἐγέννησεν τὸν ἑσρώμ ἑσρὼμ δὲ ἐγέννησεν τὸν ἀράμ
ἀρὰμ δὲ ἐγέννησεν τὸν ἀμιναδάβ ἀμιναδὰβ δὲ ἐγέννησεν τὸν ναασσών ναασσὼν δὲ ἐγέννησεν τὸν σαλμών
σαλμὼν δὲ ἐγέννησεν τὸν βοὸζ ἐκ τῆς ῥαχάβ βοὸζ δὲ ἐγέννησεν τὸν ὠβὴδ ἐκ τῆς ῥούθ ὠβὴδ δὲ ἐγέννησεν τὸν ἰεσσαί
ἰεσσαὶ δὲ ἐγέννησεν τὸν δαβὶδ τὸν βασιλέα δαβὶδ δὲ ὁ βασιλεὺς ἐγέννησεν τὸν σολομῶντα ἐκ τῆς τοῦ οὐρίου
σολομὼν δὲ ἐγέννησεν τὸν ῥοβοάμ ῥοβοὰμ δὲ ἐγέννησεν τὸν ἀβιά ἀβιὰ δὲ ἐγέννησεν τὸν ἀσά
ἀσὰ δὲ ἐγέννησεν τὸν ἰωσαφάτ ἰωσαφὰτ δὲ ἐγέννησεν τὸν ἰωράμ ἰωρὰμ δὲ ἐγέννησεν τὸν ὀζίαν
ὀζίας δὲ ἐγέννησεν τὸν ἰωάθαμ ἰωάθαμ δὲ ἐγέννησεν τὸν ἄχαζ ἄχαζ δὲ ἐγέννησεν τὸν ἐζεκίαν
ἐζεκίας δὲ ἐγέννησεν τὸν μανασσῆ μανασσῆς δὲ ἐγέννησεν τὸν ἀμών ἀμὼν δὲ ἐγέννησεν τὸν ἰωσίαν
ἰωσίας δὲ ἐγέννησεν τὸν ἰεχονίαν καὶ τοὺς ἀδελφοὺς αὐτοῦ ἐπὶ τῆς μετοικεσίας βαβυλῶνος
